"""
Лямбда-функция — это небольшая анонимная функция.
Она может принимать любое количество аргументов, но в то же время иметь только одно выражение.
"""
print('0 ----------------------------------------------')
x = lambda a, b: a*b
print(x(3, 3))
print('1 ----------------------------------------------')
y = lambda a, b, c: a+b+c
print(y(3, 5, 7))
print('2 ----------------------------------------------')
def myFunc(n):
    return lambda a: a*n
triple = myFunc(3)
print(triple(11))
print('3 ----------------------------------------------')
def newFunc(n):
    return lambda a: a*n
double = newFunc(2)
print(double(11))
print(triple(11))
print('4 ----------------------------------------------')
print('5 ----------------------------------------------')
print('6 ----------------------------------------------')